export const editComment = () => {
    // Вешаем листенер на каждую кнопку "редактировать"

    // Листенер делает текст комментария редактируемым текстовым полем
    // и делает видимой кнопку сохранить коммент + скрывает кнопку редактировать

    // В текстовое поле помещаем старый текст комментария

    // Пользователь пишет новый комментарий
    // Санитайзим пользовательский ввод

    // Пользователь нажимает кнопку сохранить комментарий

    // Извлекаем текст из текстового поля

    // Отправляем текст комментария вместе с токеном на апи c пут запросом

    // Ждем ответа

    // Если ответ успешный, то возвращаем параграф и кнопку редактировать и убираем кнопку сохранить

    // Если запрос неуспешен, то возвращаем параграф и кнопку редактировать и убираем кнопку сохранить
    // Добавляем всплывающий алерт(неблокирующий), который говорит, что произошла ошибка

    return "editCommentModule"
}
